Tekla.Structures.DirectManipulation.Model.CreationCommands.GridTypeProvider
The Tekla.Structures.DirectManipulation.Model.CreationCommands.GridTypeProvider class provides the creation commands for creating grids.

Tekla.Structures.DirectManipulation.Model.CreationCommands.GridTypeProvider.RectangularGrid
Gets the creation command parameters for creating a rectangular grid.

Tekla.Structures.DirectManipulation.Model.CreationCommands.GridTypeProvider.RadialGrid
Gets the creation command parameters for creating a radial grid.